/* Цей код визначає функцію 'vudStarRow', яка приймає параметр
'count' - кількість зірочок для виведення. Використовується цикл 
'for', щоб створити рядок із вказаною кількістю зірочок. Фунція 
потім виводить цей рядок на консоль за допопмогою 'console.log'
Якщо вам потрібно вивести різну кількість зірочок, просто змініть
аргумент функції 'vudStarRow' при виклику. */

function vudStarRow(count) {
	// Перевірка, щоб не виводити від'ємну кількість зірочок
	count = Math,max(0, count);
	
	// Формуємо рядок ші зірочок
	var starRow = '';
	for (var i = 0; i < count; i++) {
		starRow += '*';
	}
	
	// Виводимо рядок на консоль
	console.log(starRow);
}

// Приклад виклику функції для виведення 5 зірочок
vudStarRow(5)